#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.dev.data.archive_file.pubsub_function_source["channelMessage"]: Reading...
module.dev.data.archive_file.pubsub_function_source["exp"]: Reading...
module.dev.data.archive_file.pubsub_function_source["frogeOfTheDay"]: Reading...
module.dev.data.archive_file.pubsub_function_source["generateWelcomeImage"]: Reading...
module.dev.data.archive_file.pubsub_function_source["privateMessage"]: Reading...
module.dev.data.archive_file.pubsub_function_source["updateUserRole"]: Reading...
module.dev.data.archive_file.http_function_source["ban"]: Reading...
module.dev.data.archive_file.pubsub_function_source["cloudErrorLog"]: Reading...
module.dev.data.archive_file.http_function_source["hello"]: Reading...
module.dev.data.archive_file.pubsub_function_source["exp"]: Read complete after 0s [id=bf9b6bc5ac8335409b2bfb2fbb9be0eb0e116f09]
module.dev.data.archive_file.pubsub_function_source["channelMessage"]: Read complete after 0s [id=11ee72eeff88c7124659eee1f86ee4cf38b54f5b]
module.dev.data.archive_file.pubsub_function_source["privateMessage"]: Read complete after 0s [id=5305b29788056190ec120eeaca643defb7281d46]
module.dev.data.archive_file.pubsub_function_source["generateWelcomeImage"]: Read complete after 0s [id=42cf7b777fbde137b3785a8a36a0eafac217948b]
module.dev.data.archive_file.http_function_source["merch"]: Reading...
module.dev.data.archive_file.pubsub_function_source["updateUserRole"]: Read complete after 0s [id=93ff48c45ffeafd96931e0b86e287b1336eeeeda]
module.dev.data.archive_file.http_function_source["ban"]: Read complete after 0s [id=f18ae3714f39a133deaf558ead8a924d5fe6c229]
module.dev.data.archive_file.pubsub_function_source["cloudErrorLog"]: Read complete after 0s [id=58b5c4fc08e673f9a0495eaf05ce6e8aaf3bad90]
module.dev.data.archive_file.http_function_source["hello"]: Read complete after 0s [id=d3aff51c68f98c729867e28f35be543c27184d8e]
module.dev.data.archive_file.http_function_source["froge"]: Reading...
module.dev.data.archive_file.http_function_source["exam"]: Reading...
module.dev.data.archive_file.http_function_source["froge"]: Read complete after 0s [id=98990a9f59ec6a8711e7f90924fb0ce1e4b483ad]
module.dev.data.archive_file.http_function_source["exam"]: Read complete after 0s [id=36bc15ac88a834cb01ea9619206b11b5255d4d92]
module.dev.data.archive_file.http_function_source["answer"]: Reading...
module.dev.data.archive_file.http_function_source["merch"]: Read complete after 0s [id=df6f67767fcc0a096ae3706ad16d46535b3c7411]
module.dev.data.archive_file.http_function_source["gif"]: Reading...
module.dev.data.archive_file.http_function_source["listwarn"]: Reading...
module.dev.data.archive_file.http_function_source["listwarn"]: Read complete after 0s [id=252109fa737667a04b37534623605057a5f685fd]
module.dev.data.archive_file.http_function_source["go"]: Reading...
module.dev.data.archive_file.http_function_source["level"]: Reading...
module.dev.data.archive_file.http_function_source["leaderboard"]: Reading...
module.dev.data.archive_file.http_function_source["answer"]: Read complete after 0s [id=8990ff7d100ccf1a9eefa60e2fed3d07432d19e1]
module.dev.data.archive_file.http_function_source["gif"]: Read complete after 0s [id=531b9967286445e03ddd548761fd5ab6011a40b8]
module.dev.data.archive_file.http_function_source["describe"]: Reading...
module.dev.data.archive_file.http_function_source["java"]: Reading...
module.dev.data.archive_file.http_function_source["leaderboard"]: Read complete after 0s [id=d276adec74a5ac23773986b167399557ae58f455]
module.dev.data.archive_file.http_function_source["warn"]: Reading...
module.dev.data.archive_file.http_function_source["go"]: Read complete after 0s [id=2b43ceea3bef18a296541bf1613fd465c8d8fa04]
module.dev.data.archive_file.http_function_source["level"]: Read complete after 0s [id=6444b3c56d54a362e63465494761ae240ec631c9]
module.dev.data.archive_file.http_function_source["js"]: Reading...
module.dev.data.archive_file.http_function_source["video"]: Reading...
module.dev.data.archive_file.http_function_source["help"]: Reading...
module.dev.data.archive_file.http_function_source["describe"]: Read complete after 0s [id=8149d3888af4d77844b83253c94a05cff143ff3f]
module.dev.data.archive_file.http_function_source["warn"]: Read complete after 0s [id=bb50471fc4fcc30b3afd4d35789b65cd210d1bf8]
module.dev.data.archive_file.http_function_source["java"]: Read complete after 1s [id=5c394ffff4f20dea8bc47029905259fa732a6a85]
module.dev.data.archive_file.http_function_source["help"]: Read complete after 1s [id=e4f9818109e6d3c6fb840ab00b90c99a6637c51a]
module.dev.data.archive_file.http_function_source["video"]: Read complete after 1s [id=f596deb8463554d5744679eeb2214e4569389e90]
module.dev.data.archive_file.http_function_source["js"]: Read complete after 1s [id=358d1a99ccf5ba2b4581cb504eb5c5b38aadc2e7]
module.dev.google_compute_instance.default: Refreshing state... [id=projects/archy-f06ed/zones/us-central1-a/instances/e2-micro-archy]
module.dev.google_storage_bucket.function_bucket: Refreshing state... [id=archy-f06ed-function-dev]
module.dev.google_storage_bucket.froge: Refreshing state... [id=froge-bucket-dev]
module.dev.google_pubsub_topic.pubsub_topic["cloud_function_error_log"]: Refreshing state... [id=projects/archy-f06ed/topics/dev_cloud_function_error_log]
module.dev.google_logging_project_sink.cloud_function_sink: Refreshing state... [id=projects/archy-f06ed/sinks/archy-cloud-error-dev]
module.dev.google_secret_manager_secret.secret-basic["YOUTUBE_API_TOKEN"]: Refreshing state... [id=projects/archy-f06ed/secrets/YOUTUBE_API_TOKEN]
module.dev.google_secret_manager_secret.secret-basic["DISCORD_TOKEN"]: Refreshing state... [id=projects/archy-f06ed/secrets/DISCORD_TOKEN]
module.dev.google_pubsub_topic.pubsub_topic["private_message_discord"]: Refreshing state... [id=projects/archy-f06ed/topics/dev_private_message_discord]
module.dev.google_secret_manager_secret.secret-basic["TENOR_API_TOKEN"]: Refreshing state... [id=projects/archy-f06ed/secrets/TENOR_API_TOKEN]
module.dev.google_pubsub_topic.pubsub_topic["exp_discord"]: Refreshing state... [id=projects/archy-f06ed/topics/dev_exp_discord]
module.dev.google_pubsub_topic.pubsub_topic["froge_of_the_day"]: Refreshing state... [id=projects/archy-f06ed/topics/dev_froge_of_the_day]
module.dev.google_pubsub_topic.pubsub_topic["update_user_role"]: Refreshing state... [id=projects/archy-f06ed/topics/dev_update_user_role]
module.dev.google_pubsub_topic.pubsub_topic["generate_welcome_image"]: Refreshing state... [id=projects/archy-f06ed/topics/dev_generate_welcome_image]
module.dev.google_pubsub_topic.pubsub_topic["channel_message_discord"]: Refreshing state... [id=projects/archy-f06ed/topics/dev_channel_message_discord]
module.dev.google_storage_bucket_object.http_function_zip["listwarn"]: Refreshing state... [id=archy-f06ed-function-dev-src-252109fa737667a04b37534623605057a5f685fd.zip]
module.dev.google_storage_bucket_object.http_function_zip["ts"]: Refreshing state... [id=archy-f06ed-function-dev-src-8f5cd35463467338427d67cc838cf9b4d48c3926.zip]
module.dev.google_storage_bucket_object.http_function_zip["level"]: Refreshing state... [id=archy-f06ed-function-dev-src-4c168565721f4c3b20c47decf676f67afe82eadf.zip]
module.dev.data.archive_file.pubsub_function_source["frogeOfTheDay"]: Read complete after 1s [id=cc3f580711a1b045a67ae63d5304883877801cce]
module.dev.google_storage_bucket_object.http_function_zip["gif"]: Refreshing state... [id=archy-f06ed-function-dev-src-531b9967286445e03ddd548761fd5ab6011a40b8.zip]
module.dev.google_storage_bucket_object.http_function_zip["video"]: Refreshing state... [id=archy-f06ed-function-dev-src-f596deb8463554d5744679eeb2214e4569389e90.zip]
module.dev.google_storage_bucket_object.http_function_zip["js"]: Refreshing state... [id=archy-f06ed-function-dev-src-827b1170ebaff989faf452b3ce21e68d5c9a14f8.zip]
module.dev.google_storage_bucket_object.http_function_zip["warn"]: Refreshing state... [id=archy-f06ed-function-dev-src-bb50471fc4fcc30b3afd4d35789b65cd210d1bf8.zip]
module.dev.google_storage_bucket_object.http_function_zip["froge"]: Refreshing state... [id=archy-f06ed-function-dev-src-98990a9f59ec6a8711e7f90924fb0ce1e4b483ad.zip]
module.dev.google_storage_bucket_object.http_function_zip["ban"]: Refreshing state... [id=archy-f06ed-function-dev-src-f18ae3714f39a133deaf558ead8a924d5fe6c229.zip]
module.dev.google_storage_bucket_object.http_function_zip["answer"]: Refreshing state... [id=archy-f06ed-function-dev-src-8990ff7d100ccf1a9eefa60e2fed3d07432d19e1.zip]
module.dev.google_storage_bucket_object.http_function_zip["describe"]: Refreshing state... [id=archy-f06ed-function-dev-src-8149d3888af4d77844b83253c94a05cff143ff3f.zip]
module.dev.google_storage_bucket_object.http_function_zip["hello"]: Refreshing state... [id=archy-f06ed-function-dev-src-d3aff51c68f98c729867e28f35be543c27184d8e.zip]
module.dev.google_storage_bucket_object.http_function_zip["help"]: Refreshing state... [id=archy-f06ed-function-dev-src-e4f9818109e6d3c6fb840ab00b90c99a6637c51a.zip]
module.dev.google_storage_bucket_object.http_function_zip["leaderboard"]: Refreshing state... [id=archy-f06ed-function-dev-src-d276adec74a5ac23773986b167399557ae58f455.zip]
module.dev.google_storage_bucket_object.http_function_zip["java"]: Refreshing state... [id=archy-f06ed-function-dev-src-5c394ffff4f20dea8bc47029905259fa732a6a85.zip]
module.dev.google_storage_bucket_object.http_function_zip["go"]: Refreshing state... [id=archy-f06ed-function-dev-src-2b43ceea3bef18a296541bf1613fd465c8d8fa04.zip]
module.dev.google_storage_bucket_object.http_function_zip["merch"]: Refreshing state... [id=archy-f06ed-function-dev-src-df6f67767fcc0a096ae3706ad16d46535b3c7411.zip]
module.dev.google_storage_bucket_object.http_function_zip["exam"]: Refreshing state... [id=archy-f06ed-function-dev-src-36bc15ac88a834cb01ea9619206b11b5255d4d92.zip]
module.dev.google_storage_bucket_object.http_function_zip["og_vercel"]: Refreshing state... [id=archy-f06ed-function-dev-src-884c3fbedee039c224b5e1b58115bf4d4f5fdd2e.zip]
module.dev.google_storage_bucket_object.pubsub_function_zip["channelMessage"]: Refreshing state... [id=archy-f06ed-function-dev-src-11ee72eeff88c7124659eee1f86ee4cf38b54f5b.zip]
module.dev.google_storage_bucket_object.pubsub_function_zip["cloudErrorLog"]: Refreshing state... [id=archy-f06ed-function-dev-src-58b5c4fc08e673f9a0495eaf05ce6e8aaf3bad90.zip]
module.dev.google_storage_bucket_object.pubsub_function_zip["frogeOfTheDay"]: Refreshing state... [id=archy-f06ed-function-dev-src-cc3f580711a1b045a67ae63d5304883877801cce.zip]
module.dev.google_storage_bucket_object.pubsub_function_zip["exp"]: Refreshing state... [id=archy-f06ed-function-dev-src-bf9b6bc5ac8335409b2bfb2fbb9be0eb0e116f09.zip]
module.dev.google_storage_bucket_object.pubsub_function_zip["generateWelcomeImage"]: Refreshing state... [id=archy-f06ed-function-dev-src-42cf7b777fbde137b3785a8a36a0eafac217948b.zip]
module.dev.google_storage_bucket_object.pubsub_function_zip["privateMessage"]: Refreshing state... [id=archy-f06ed-function-dev-src-5305b29788056190ec120eeaca643defb7281d46.zip]
module.dev.google_storage_bucket_object.pubsub_function_zip["updateUserRole"]: Refreshing state... [id=archy-f06ed-function-dev-src-93ff48c45ffeafd96931e0b86e287b1336eeeeda.zip]
module.dev.google_cloudfunctions_function.http_function["video"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_video]
module.dev.google_cloudfunctions_function.http_function["go"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_go]
module.dev.google_cloudfunctions_function.http_function["listwarn"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_listwarn]
module.dev.google_cloudfunctions_function.http_function["ban"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_ban]
module.dev.google_cloudfunctions_function.http_function["merch"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_merch]
module.dev.google_cloudfunctions_function.http_function["ts"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_ts]
module.dev.google_cloudfunctions_function.http_function["describe"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_describe]
module.dev.google_cloudfunctions_function.http_function["leaderboard"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_leaderboard]
module.dev.google_cloudfunctions_function.http_function["help"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_help]
module.dev.google_cloudfunctions_function.http_function["warn"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_warn]
module.dev.google_cloudfunctions_function.http_function["answer"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_answer]
module.dev.google_cloudfunctions_function.http_function["hello"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_hello]
module.dev.google_cloudfunctions_function.http_function["level"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_level]
module.dev.google_cloudfunctions_function.http_function["js"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_js]
module.dev.google_cloudfunctions_function.http_function["gif"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_gif]
module.dev.google_cloudfunctions_function.http_function["exam"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_exam]
module.dev.google_cloudfunctions_function.http_function["og_vercel"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_og_vercel]
module.dev.google_cloudfunctions_function.http_function["froge"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_froge]
module.dev.google_cloudfunctions_function.http_function["java"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_java]
module.dev.google_cloudfunctions_function.pubsub_function["cloudErrorLog"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_cloudErrorLog]
module.dev.google_cloudfunctions_function.pubsub_function["generateWelcomeImage"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_generateWelcomeImage]
module.dev.google_cloudfunctions_function.pubsub_function["exp"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_exp]
module.dev.google_cloudfunctions_function.pubsub_function["frogeOfTheDay"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_frogeOfTheDay]
module.dev.google_cloudfunctions_function.pubsub_function["updateUserRole"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_updateUserRole]
module.dev.google_cloudfunctions_function.pubsub_function["channelMessage"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_channelMessage]
module.dev.google_cloudfunctions_function.pubsub_function["privateMessage"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_privateMessage]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.dev.google_storage_bucket_object.http_function_zip["og_vercel"] has changed
  ~ resource "google_storage_bucket_object" "http_function_zip" {
        id               = "archy-f06ed-function-dev-src-884c3fbedee039c224b5e1b58115bf4d4f5fdd2e.zip"
      + metadata         = {}
        name             = "src-884c3fbedee039c224b5e1b58115bf4d4f5fdd2e.zip"
        # (12 unchanged attributes hidden)
    }

  # module.dev.google_storage_bucket_object.http_function_zip["ts"] has changed
  ~ resource "google_storage_bucket_object" "http_function_zip" {
        id               = "archy-f06ed-function-dev-src-8f5cd35463467338427d67cc838cf9b4d48c3926.zip"
      + metadata         = {}
        name             = "src-8f5cd35463467338427d67cc838cf9b4d48c3926.zip"
        # (12 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.dev.google_cloudfunctions_function.http_function["js"] will be updated in-place
  ~ resource "google_cloudfunctions_function" "http_function" {
        id                           = "projects/archy-f06ed/locations/us-central1/functions/dev_js"
        name                         = "dev_js"
      ~ source_archive_object        = "src-827b1170ebaff989faf452b3ce21e68d5c9a14f8.zip" -> "src-358d1a99ccf5ba2b4581cb504eb5c5b38aadc2e7.zip"
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.dev.google_cloudfunctions_function.http_function["level"] will be updated in-place
  ~ resource "google_cloudfunctions_function" "http_function" {
        id                           = "projects/archy-f06ed/locations/us-central1/functions/dev_level"
        name                         = "dev_level"
      ~ source_archive_object        = "src-4c168565721f4c3b20c47decf676f67afe82eadf.zip" -> "src-6444b3c56d54a362e63465494761ae240ec631c9.zip"
        # (18 unchanged attributes hidden)
    }

  # module.dev.google_cloudfunctions_function.http_function["og_vercel"] will be destroyed
  # (because key ["og_vercel"] is not in for_each map)
  - resource "google_cloudfunctions_function" "http_function" {
      - available_memory_mb          = 256 -> null
      - description                  = "NextJs app use to generate level template" -> null
      - docker_registry              = "CONTAINER_REGISTRY" -> null
      - entry_point                  = "handler" -> null
      - environment_variables        = {} -> null
      - https_trigger_security_level = "SECURE_OPTIONAL" -> null
      - https_trigger_url            = "https://us-central1-archy-f06ed.cloudfunctions.net/dev_og_vercel" -> null
      - id                           = "projects/archy-f06ed/locations/us-central1/functions/dev_og_vercel" -> null
      - ingress_settings             = "ALLOW_ALL" -> null
      - labels                       = {} -> null
      - max_instances                = 5 -> null
      - min_instances                = 0 -> null
      - name                         = "dev_og_vercel" -> null
      - project                      = "archy-f06ed" -> null
      - region                       = "us-central1" -> null
      - runtime                      = "nodejs16" -> null
      - service_account_email        = "archyapi@archy-f06ed.iam.gserviceaccount.com" -> null
      - source_archive_bucket        = "archy-f06ed-function-dev" -> null
      - source_archive_object        = "src-884c3fbedee039c224b5e1b58115bf4d4f5fdd2e.zip" -> null
      - timeout                      = 15 -> null
      - trigger_http                 = true -> null
    }

  # module.dev.google_cloudfunctions_function.http_function["ts"] will be destroyed
  # (because key ["ts"] is not in for_each map)
  - resource "google_cloudfunctions_function" "http_function" {
      - available_memory_mb          = 256 -> null
      - description                  = "Template of a function in Typescript" -> null
      - docker_registry              = "CONTAINER_REGISTRY" -> null
      - entry_point                  = "ts" -> null
      - environment_variables        = {} -> null
      - https_trigger_security_level = "SECURE_OPTIONAL" -> null
      - https_trigger_url            = "https://us-central1-archy-f06ed.cloudfunctions.net/dev_ts" -> null
      - id                           = "projects/archy-f06ed/locations/us-central1/functions/dev_ts" -> null
      - ingress_settings             = "ALLOW_ALL" -> null
      - labels                       = {} -> null
      - max_instances                = 5 -> null
      - min_instances                = 0 -> null
      - name                         = "dev_ts" -> null
      - project                      = "archy-f06ed" -> null
      - region                       = "us-central1" -> null
      - runtime                      = "nodejs16" -> null
      - service_account_email        = "archyapi@archy-f06ed.iam.gserviceaccount.com" -> null
      - source_archive_bucket        = "archy-f06ed-function-dev" -> null
      - source_archive_object        = "src-8f5cd35463467338427d67cc838cf9b4d48c3926.zip" -> null
      - timeout                      = 15 -> null
      - trigger_http                 = true -> null
    }

  # module.dev.google_storage_bucket.froge must be replaced
-/+ resource "google_storage_bucket" "froge" {
      - default_event_based_hold    = false -> null
      ~ id                          = "froge-bucket-dev" -> (known after apply)
      - labels                      = {} -> null
      ~ name                        = "froge-bucket-dev" -> "froge-public-bucket-dev" # forces replacement
      ~ project                     = "archy-f06ed" -> (known after apply)
      ~ public_access_prevention    = "enforced" -> (known after apply)
      - requester_pays              = false -> null
      ~ self_link                   = "https://www.googleapis.com/storage/v1/b/froge-bucket-dev" -> (known after apply)
      ~ uniform_bucket_level_access = false -> (known after apply)
      ~ url                         = "gs://froge-bucket-dev" -> (known after apply)
        # (3 unchanged attributes hidden)

      + versioning {
          + enabled = (known after apply)
        }
    }

  # module.dev.google_storage_bucket_access_control.public_rule will be created
  + resource "google_storage_bucket_access_control" "public_rule" {
      + bucket = "froge-public-bucket-dev"
      + domain = (known after apply)
      + email  = (known after apply)
      + entity = "allUsers"
      + id     = (known after apply)
      + role   = "READER"
    }

  # module.dev.google_storage_bucket_object.http_function_zip["js"] must be replaced
-/+ resource "google_storage_bucket_object" "http_function_zip" {
      ~ crc32c           = "aZw4bw==" -> (known after apply)
      ~ detect_md5hash   = "UeWqTzg8eP85txl/fmCcdg==" -> "different hash" # forces replacement
      - event_based_hold = false -> null
      ~ id               = "archy-f06ed-function-dev-src-827b1170ebaff989faf452b3ce21e68d5c9a14f8.zip" -> (known after apply)
      + kms_key_name     = (known after apply)
      ~ md5hash          = "UeWqTzg8eP85txl/fmCcdg==" -> (known after apply)
      ~ media_link       = "https://storage.googleapis.com/download/storage/v1/b/archy-f06ed-function-dev/o/src-827b1170ebaff989faf452b3ce21e68d5c9a14f8.zip?generation=1669252581240241&alt=media" -> (known after apply)
      - metadata         = {} -> null
      ~ name             = "src-827b1170ebaff989faf452b3ce21e68d5c9a14f8.zip" -> "src-358d1a99ccf5ba2b4581cb504eb5c5b38aadc2e7.zip" # forces replacement
      ~ output_name      = "src-827b1170ebaff989faf452b3ce21e68d5c9a14f8.zip" -> (known after apply)
      ~ self_link        = "https://www.googleapis.com/storage/v1/b/archy-f06ed-function-dev/o/src-827b1170ebaff989faf452b3ce21e68d5c9a14f8.zip" -> (known after apply)
      ~ storage_class    = "STANDARD" -> (known after apply)
      - temporary_hold   = false -> null
        # (3 unchanged attributes hidden)
    }

  # module.dev.google_storage_bucket_object.http_function_zip["level"] must be replaced
-/+ resource "google_storage_bucket_object" "http_function_zip" {
      ~ crc32c           = "2u3aew==" -> (known after apply)
      ~ detect_md5hash   = "6C38wErRE45EJ7TRvwemxQ==" -> "different hash" # forces replacement
      - event_based_hold = false -> null
      ~ id               = "archy-f06ed-function-dev-src-4c168565721f4c3b20c47decf676f67afe82eadf.zip" -> (known after apply)
      + kms_key_name     = (known after apply)
      ~ md5hash          = "6C38wErRE45EJ7TRvwemxQ==" -> (known after apply)
      ~ media_link       = "https://storage.googleapis.com/download/storage/v1/b/archy-f06ed-function-dev/o/src-4c168565721f4c3b20c47decf676f67afe82eadf.zip?generation=1669253975395707&alt=media" -> (known after apply)
      - metadata         = {} -> null
      ~ name             = "src-4c168565721f4c3b20c47decf676f67afe82eadf.zip" -> "src-6444b3c56d54a362e63465494761ae240ec631c9.zip" # forces replacement
      ~ output_name      = "src-4c168565721f4c3b20c47decf676f67afe82eadf.zip" -> (known after apply)
      ~ self_link        = "https://www.googleapis.com/storage/v1/b/archy-f06ed-function-dev/o/src-4c168565721f4c3b20c47decf676f67afe82eadf.zip" -> (known after apply)
      ~ storage_class    = "STANDARD" -> (known after apply)
      - temporary_hold   = false -> null
        # (3 unchanged attributes hidden)
    }

  # module.dev.google_storage_bucket_object.http_function_zip["og_vercel"] will be destroyed
  # (because key ["og_vercel"] is not in for_each map)
  - resource "google_storage_bucket_object" "http_function_zip" {
      - bucket           = "archy-f06ed-function-dev" -> null
      - content_type     = "application/zip" -> null
      - crc32c           = "62tmVw==" -> null
      - detect_md5hash   = "bHkySA8kCaIz4NatNZB8+g==" -> null
      - event_based_hold = false -> null
      - id               = "archy-f06ed-function-dev-src-884c3fbedee039c224b5e1b58115bf4d4f5fdd2e.zip" -> null
      - md5hash          = "bHkySA8kCaIz4NatNZB8+g==" -> null
      - media_link       = "https://storage.googleapis.com/download/storage/v1/b/archy-f06ed-function-dev/o/src-884c3fbedee039c224b5e1b58115bf4d4f5fdd2e.zip?generation=1669254907660271&alt=media" -> null
      - metadata         = {} -> null
      - name             = "src-884c3fbedee039c224b5e1b58115bf4d4f5fdd2e.zip" -> null
      - output_name      = "src-884c3fbedee039c224b5e1b58115bf4d4f5fdd2e.zip" -> null
      - self_link        = "https://www.googleapis.com/storage/v1/b/archy-f06ed-function-dev/o/src-884c3fbedee039c224b5e1b58115bf4d4f5fdd2e.zip" -> null
      - source           = "/tmp/og_vercel.zip" -> null
      - storage_class    = "STANDARD" -> null
      - temporary_hold   = false -> null
    }

  # module.dev.google_storage_bucket_object.http_function_zip["ts"] will be destroyed
  # (because key ["ts"] is not in for_each map)
  - resource "google_storage_bucket_object" "http_function_zip" {
      - bucket           = "archy-f06ed-function-dev" -> null
      - content_type     = "application/zip" -> null
      - crc32c           = "FwhQnw==" -> null
      - detect_md5hash   = "L5RMQSHr1dryu5Oz4wWNHQ==" -> null
      - event_based_hold = false -> null
      - id               = "archy-f06ed-function-dev-src-8f5cd35463467338427d67cc838cf9b4d48c3926.zip" -> null
      - md5hash          = "L5RMQSHr1dryu5Oz4wWNHQ==" -> null
      - media_link       = "https://storage.googleapis.com/download/storage/v1/b/archy-f06ed-function-dev/o/src-8f5cd35463467338427d67cc838cf9b4d48c3926.zip?generation=1669254906340749&alt=media" -> null
      - metadata         = {} -> null
      - name             = "src-8f5cd35463467338427d67cc838cf9b4d48c3926.zip" -> null
      - output_name      = "src-8f5cd35463467338427d67cc838cf9b4d48c3926.zip" -> null
      - self_link        = "https://www.googleapis.com/storage/v1/b/archy-f06ed-function-dev/o/src-8f5cd35463467338427d67cc838cf9b4d48c3926.zip" -> null
      - source           = "/tmp/ts.zip" -> null
      - storage_class    = "STANDARD" -> null
      - temporary_hold   = false -> null
    }

Plan: 4 to add, 2 to change, 7 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @ArmandBriere, Action: `pull_request`, Working Directory: ``, Workflow: `Run terraform plan for development`*